; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=294, out_folder=htg/blocksworld/training, instance_id=58, seed=2082, goal_proportion=0.03

(define (problem blocksworld-58)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 b265 b266 b267 b268 b269 b270 b271 b272 b273 b274 b275 b276 b277 b278 b279 b280 b281 b282 b283 b284 b285 b286 b287 b288 b289 b290 b291 b292 b293 b294 - object)
 (:init 
    (arm-empty)
    (clear b97)
    (on b97 b167)
    (on b167 b248)
    (on b248 b276)
    (on b276 b71)
    (on b71 b244)
    (on b244 b2)
    (on b2 b209)
    (on b209 b280)
    (on b280 b221)
    (on-table b221)
    (clear b66)
    (on b66 b101)
    (on-table b101)
    (clear b220)
    (on-table b220)
    (clear b237)
    (on-table b237)
    (clear b232)
    (on b232 b33)
    (on b33 b58)
    (on b58 b20)
    (on-table b20)
    (clear b256)
    (on-table b256)
    (clear b202)
    (on b202 b80)
    (on b80 b145)
    (on-table b145)
    (clear b250)
    (on b250 b161)
    (on-table b161)
    (clear b24)
    (on-table b24)
    (clear b158)
    (on b158 b178)
    (on b178 b84)
    (on-table b84)
    (clear b132)
    (on b132 b164)
    (on b164 b177)
    (on b177 b128)
    (on b128 b263)
    (on b263 b123)
    (on b123 b240)
    (on b240 b12)
    (on b12 b3)
    (on-table b3)
    (clear b53)
    (on b53 b129)
    (on b129 b139)
    (on b139 b190)
    (on-table b190)
    (clear b41)
    (on b41 b293)
    (on-table b293)
    (clear b200)
    (on b200 b125)
    (on b125 b61)
    (on-table b61)
    (clear b93)
    (on b93 b182)
    (on b182 b242)
    (on b242 b166)
    (on b166 b91)
    (on b91 b18)
    (on-table b18)
    (clear b270)
    (on b270 b241)
    (on b241 b193)
    (on b193 b282)
    (on b282 b127)
    (on b127 b287)
    (on b287 b63)
    (on b63 b16)
    (on b16 b153)
    (on b153 b104)
    (on b104 b75)
    (on b75 b196)
    (on b196 b231)
    (on-table b231)
    (clear b26)
    (on-table b26)
    (clear b278)
    (on b278 b51)
    (on-table b51)
    (clear b255)
    (on b255 b185)
    (on b185 b216)
    (on b216 b272)
    (on b272 b259)
    (on-table b259)
    (clear b43)
    (on-table b43)
    (clear b227)
    (on b227 b5)
    (on-table b5)
    (clear b108)
    (on b108 b277)
    (on-table b277)
    (clear b4)
    (on b4 b233)
    (on b233 b103)
    (on b103 b172)
    (on-table b172)
    (clear b226)
    (on b226 b149)
    (on b149 b79)
    (on b79 b1)
    (on b1 b150)
    (on b150 b118)
    (on b118 b224)
    (on b224 b269)
    (on b269 b113)
    (on-table b113)
    (clear b14)
    (on-table b14)
    (clear b197)
    (on-table b197)
    (clear b45)
    (on b45 b218)
    (on b218 b148)
    (on-table b148)
    (clear b285)
    (on b285 b98)
    (on b98 b36)
    (on b36 b82)
    (on b82 b238)
    (on-table b238)
    (clear b159)
    (on-table b159)
    (clear b253)
    (on-table b253)
    (clear b34)
    (on b34 b214)
    (on b214 b31)
    (on b31 b222)
    (on b222 b95)
    (on b95 b68)
    (on b68 b225)
    (on b225 b105)
    (on-table b105)
    (clear b204)
    (on b204 b246)
    (on b246 b251)
    (on-table b251)
    (clear b74)
    (on b74 b42)
    (on b42 b165)
    (on b165 b130)
    (on-table b130)
    (clear b19)
    (on b19 b144)
    (on b144 b174)
    (on b174 b223)
    (on-table b223)
    (clear b152)
    (on-table b152)
    (clear b23)
    (on b23 b110)
    (on b110 b206)
    (on b206 b137)
    (on b137 b260)
    (on b260 b184)
    (on b184 b27)
    (on b27 b195)
    (on b195 b257)
    (on b257 b155)
    (on-table b155)
    (clear b210)
    (on b210 b77)
    (on b77 b181)
    (on-table b181)
    (clear b109)
    (on b109 b96)
    (on-table b96)
    (clear b141)
    (on b141 b122)
    (on b122 b32)
    (on b32 b22)
    (on b22 b86)
    (on b86 b290)
    (on b290 b288)
    (on b288 b76)
    (on b76 b160)
    (on-table b160)
    (clear b30)
    (on b30 b70)
    (on b70 b245)
    (on b245 b191)
    (on b191 b124)
    (on b124 b261)
    (on b261 b138)
    (on b138 b163)
    (on-table b163)
    (clear b10)
    (on b10 b186)
    (on b186 b275)
    (on b275 b134)
    (on b134 b212)
    (on b212 b201)
    (on b201 b133)
    (on b133 b267)
    (on b267 b208)
    (on-table b208)
    (clear b146)
    (on b146 b55)
    (on-table b55)
    (clear b57)
    (on b57 b176)
    (on b176 b189)
    (on b189 b268)
    (on b268 b50)
    (on b50 b162)
    (on b162 b154)
    (on-table b154)
    (clear b284)
    (on b284 b286)
    (on b286 b44)
    (on b44 b119)
    (on-table b119)
    (clear b111)
    (on-table b111)
    (clear b64)
    (on b64 b207)
    (on b207 b21)
    (on-table b21)
    (clear b171)
    (on b171 b126)
    (on b126 b140)
    (on b140 b49)
    (on-table b49)
    (clear b229)
    (on-table b229)
    (clear b59)
    (on b59 b254)
    (on b254 b94)
    (on b94 b187)
    (on b187 b243)
    (on b243 b271)
    (on b271 b252)
    (on b252 b81)
    (on b81 b17)
    (on b17 b228)
    (on b228 b15)
    (on b15 b131)
    (on b131 b192)
    (on b192 b264)
    (on b264 b292)
    (on b292 b88)
    (on b88 b73)
    (on b73 b65)
    (on-table b65)
    (clear b135)
    (on-table b135)
    (clear b281)
    (on b281 b8)
    (on b8 b114)
    (on-table b114)
    (clear b291)
    (on-table b291)
    (clear b39)
    (on-table b39)
    (clear b62)
    (on b62 b217)
    (on b217 b219)
    (on b219 b54)
    (on-table b54)
    (clear b25)
    (on-table b25)
    (clear b107)
    (on b107 b117)
    (on b117 b180)
    (on b180 b169)
    (on b169 b78)
    (on-table b78)
    (clear b235)
    (on-table b235)
    (clear b28)
    (on b28 b211)
    (on-table b211)
    (clear b179)
    (on b179 b247)
    (on-table b247)
    (clear b7)
    (on b7 b283)
    (on-table b283)
    (clear b92)
    (on b92 b258)
    (on b258 b37)
    (on b37 b168)
    (on b168 b89)
    (on b89 b151)
    (on b151 b205)
    (on b205 b147)
    (on b147 b121)
    (on-table b121)
    (clear b157)
    (on b157 b199)
    (on b199 b203)
    (on b203 b9)
    (on b9 b262)
    (on b262 b265)
    (on-table b265)
    (clear b48)
    (on-table b48)
    (clear b35)
    (on b35 b170)
    (on b170 b289)
    (on b289 b100)
    (on b100 b87)
    (on b87 b29)
    (on b29 b116)
    (on b116 b239)
    (on b239 b274)
    (on-table b274)
    (clear b198)
    (on b198 b136)
    (on-table b136)
    (clear b236)
    (on b236 b52)
    (on b52 b46)
    (on b46 b273)
    (on-table b273)
    (clear b112)
    (on b112 b99)
    (on b99 b6)
    (on-table b6)
    (clear b215)
    (on b215 b183)
    (on b183 b115)
    (on b115 b156)
    (on-table b156)
    (clear b230)
    (on b230 b13)
    (on b13 b120)
    (on b120 b72)
    (on b72 b234)
    (on b234 b143)
    (on b143 b102)
    (on b102 b85)
    (on b85 b279)
    (on b279 b294)
    (on b294 b249)
    (on b249 b194)
    (on b194 b38)
    (on b38 b67)
    (on b67 b173)
    (on b173 b69)
    (on-table b69)
    (clear b47)
    (on b47 b56)
    (on b56 b188)
    (on b188 b266)
    (on-table b266)
    (clear b90)
    (on b90 b106)
    (on b106 b142)
    (on b142 b175)
    (on-table b175)
    (clear b83)
    (on b83 b11)
    (on b11 b213)
    (on-table b213)
    (clear b40)
    (on b40 b60)
    (on-table b60))
 (:goal  (and 
    (clear b2)
    (on b2 b8)
    (on b8 b5)
    (on-table b5)
    (clear b3)
    (on b3 b7)
    (on-table b7)
    (clear b1)
    (on-table b1)
    (clear b4)
    (on-table b4)
    (clear b6)
    (on-table b6))))

; plan
1. (unstack b7 b283)
   deleted: (on b7 b283) (clear b7) (arm-empty)
   added: (holding b7) (clear b283)
   goals met: 3 of 13
2. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 4 of 13
3. (unstack b4 b233)
   deleted: (on b4 b233) (clear b4) (arm-empty)
   added: (holding b4) (clear b233)
   goals met: 3 of 13
4. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 5 of 13
5. (unstack b112 b99)
   deleted: (on b112 b99) (clear b112) (arm-empty)
   added: (holding b112) (clear b99)
   goals met: 5 of 13
6. (putdown b112)
   deleted: (holding b112)
   added: (clear b112) (arm-empty) (on-table b112)
   goals met: 5 of 13
7. (unstack b132 b164)
   deleted: (on b132 b164) (clear b132) (arm-empty)
   added: (holding b132) (clear b164)
   goals met: 5 of 13
8. (putdown b132)
   deleted: (holding b132)
   added: (clear b132) (arm-empty) (on-table b132)
   goals met: 5 of 13
9. (unstack b164 b177)
   deleted: (on b164 b177) (clear b164) (arm-empty)
   added: (holding b164) (clear b177)
   goals met: 5 of 13
10. (putdown b164)
   deleted: (holding b164)
   added: (clear b164) (arm-empty) (on-table b164)
   goals met: 5 of 13
11. (unstack b177 b128)
   deleted: (on b177 b128) (clear b177) (arm-empty)
   added: (holding b177) (clear b128)
   goals met: 5 of 13
12. (putdown b177)
   deleted: (holding b177)
   added: (clear b177) (arm-empty) (on-table b177)
   goals met: 5 of 13
13. (unstack b128 b263)
   deleted: (on b128 b263) (clear b128) (arm-empty)
   added: (holding b128) (clear b263)
   goals met: 5 of 13
14. (putdown b128)
   deleted: (holding b128)
   added: (clear b128) (arm-empty) (on-table b128)
   goals met: 5 of 13
15. (unstack b226 b149)
   deleted: (on b226 b149) (clear b226) (arm-empty)
   added: (holding b226) (clear b149)
   goals met: 5 of 13
16. (putdown b226)
   deleted: (holding b226)
   added: (clear b226) (arm-empty) (on-table b226)
   goals met: 5 of 13
17. (unstack b149 b79)
   deleted: (on b149 b79) (clear b149) (arm-empty)
   added: (holding b149) (clear b79)
   goals met: 5 of 13
18. (putdown b149)
   deleted: (holding b149)
   added: (clear b149) (arm-empty) (on-table b149)
   goals met: 5 of 13
19. (unstack b227 b5)
   deleted: (on b227 b5) (clear b227) (arm-empty)
   added: (holding b227) (clear b5)
   goals met: 5 of 13
20. (putdown b227)
   deleted: (holding b227)
   added: (clear b227) (arm-empty) (on-table b227)
   goals met: 5 of 13
21. (unstack b263 b123)
   deleted: (on b263 b123) (clear b263) (arm-empty)
   added: (holding b263) (clear b123)
   goals met: 5 of 13
22. (putdown b263)
   deleted: (holding b263)
   added: (clear b263) (arm-empty) (on-table b263)
   goals met: 5 of 13
23. (unstack b123 b240)
   deleted: (on b123 b240) (clear b123) (arm-empty)
   added: (holding b123) (clear b240)
   goals met: 5 of 13
24. (putdown b123)
   deleted: (holding b123)
   added: (clear b123) (arm-empty) (on-table b123)
   goals met: 5 of 13
25. (unstack b240 b12)
   deleted: (on b240 b12) (clear b240) (arm-empty)
   added: (holding b240) (clear b12)
   goals met: 5 of 13
26. (putdown b240)
   deleted: (holding b240)
   added: (clear b240) (arm-empty) (on-table b240)
   goals met: 5 of 13
27. (unstack b12 b3)
   deleted: (on b12 b3) (clear b12) (arm-empty)
   added: (holding b12) (clear b3)
   goals met: 6 of 13
28. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 6 of 13
29. (unstack b281 b8)
   deleted: (on b281 b8) (clear b281) (arm-empty)
   added: (holding b281) (clear b8)
   goals met: 6 of 13
30. (putdown b281)
   deleted: (holding b281)
   added: (clear b281) (arm-empty) (on-table b281)
   goals met: 6 of 13
31. (unstack b79 b1)
   deleted: (on b79 b1) (clear b79) (arm-empty)
   added: (holding b79) (clear b1)
   goals met: 7 of 13
32. (putdown b79)
   deleted: (holding b79)
   added: (clear b79) (arm-empty) (on-table b79)
   goals met: 7 of 13
33. (unstack b1 b150)
   deleted: (on b1 b150) (clear b1) (arm-empty)
   added: (holding b1) (clear b150)
   goals met: 6 of 13
34. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 8 of 13
35. (unstack b97 b167)
   deleted: (on b97 b167) (clear b97) (arm-empty)
   added: (holding b97) (clear b167)
   goals met: 8 of 13
36. (putdown b97)
   deleted: (holding b97)
   added: (clear b97) (arm-empty) (on-table b97)
   goals met: 8 of 13
37. (unstack b167 b248)
   deleted: (on b167 b248) (clear b167) (arm-empty)
   added: (holding b167) (clear b248)
   goals met: 8 of 13
38. (putdown b167)
   deleted: (holding b167)
   added: (clear b167) (arm-empty) (on-table b167)
   goals met: 8 of 13
39. (unstack b248 b276)
   deleted: (on b248 b276) (clear b248) (arm-empty)
   added: (holding b248) (clear b276)
   goals met: 8 of 13
40. (putdown b248)
   deleted: (holding b248)
   added: (clear b248) (arm-empty) (on-table b248)
   goals met: 8 of 13
41. (unstack b276 b71)
   deleted: (on b276 b71) (clear b276) (arm-empty)
   added: (holding b276) (clear b71)
   goals met: 8 of 13
42. (putdown b276)
   deleted: (holding b276)
   added: (clear b276) (arm-empty) (on-table b276)
   goals met: 8 of 13
43. (unstack b71 b244)
   deleted: (on b71 b244) (clear b71) (arm-empty)
   added: (holding b71) (clear b244)
   goals met: 8 of 13
44. (putdown b71)
   deleted: (holding b71)
   added: (clear b71) (arm-empty) (on-table b71)
   goals met: 8 of 13
45. (unstack b244 b2)
   deleted: (on b244 b2) (clear b244) (arm-empty)
   added: (holding b244) (clear b2)
   goals met: 9 of 13
46. (putdown b244)
   deleted: (holding b244)
   added: (clear b244) (arm-empty) (on-table b244)
   goals met: 9 of 13
47. (unstack b99 b6)
   deleted: (on b99 b6) (clear b99) (arm-empty)
   added: (holding b99) (clear b6)
   goals met: 10 of 13
48. (putdown b99)
   deleted: (holding b99)
   added: (clear b99) (arm-empty) (on-table b99)
   goals met: 10 of 13
49. (unstack b8 b114)
   deleted: (on b8 b114) (clear b8) (arm-empty)
   added: (holding b8) (clear b114)
   goals met: 10 of 13
50. (stack b8 b5)
   deleted: (clear b5) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b5)
   goals met: 11 of 13
51. (unstack b2 b209)
   deleted: (on b2 b209) (clear b2) (arm-empty)
   added: (holding b2) (clear b209)
   goals met: 10 of 13
52. (stack b2 b8)
   deleted: (clear b8) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b8)
   goals met: 12 of 13
53. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 11 of 13
54. (stack b3 b7)
   deleted: (clear b7) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b7)
   goals met: 13 of 13
